## 本次課堂中學到的東西
* interpolate工具-可以模擬出遺失的資料
* def自訂函數-可以自訂一些計算方式，方便重複使用
* pandas工具-可以建立DataFrames格式的資料，方便整理及輸出到Excel端
* open工具-可以開啟檔案
* write工具-可以寫入檔案內容

In [5]:
def hello():
    print("hello world")
hello()

hello world

In [3]:
def string(name,age):
    msg = f'{name} is {age} years old'
    print(msg)
string("Ken","13")

def add_num(x,y=10):
    z = x + y
    print(z)
add_num(8)

Ken is 13 years old
18

In [2]:
import pandas as pd
import numpy as np
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
def two_step_add(x,y):
    result = x + y*2
    return result
b = two_step_add(1,2)
c = two_step_add(2,3)
b,c

(5, 8)

In [7]:
def res_while(x):
    result = 0
    while result < 10:
        result = result + x
        if result == 5: # 2+2 = 4 4+2 = 6 所以不會遇到result == 5
            return result
    return result

b = res_while(1)
c = res_while(2)

b,c

(5, 10)

In [8]:
def tf(value):
    return 2 * value - 1

test_values = [0.0,0.0011,0.25,0.5,0,54,0.75,1.0]
scaled_values = [tf(value) for value in test_values]
print(f"Original val {test_values}")
print(f"Scaled val {scaled_values}")

Original val [0.0, 0.0011, 0.25, 0.5, 0, 54, 0.75, 1.0]
Scaled val [-1.0, -0.9978, -0.5, 0.0, -1, 107, 0.5, 1.0]

In [9]:
def adding(n):
    if n == 0 or n == 1:
        return 1
    else:
        return n + adding(n-1)
    
print(adding(3))

6

In [10]:
with open("test.txt","w") as f1:
    f1.write("good morning")

In [13]:
import datetime
print(datetime.datetime.now())
print(datetime.date.today())

2024-09-26 16:57:18.348753
2024-09-26

In [14]:
import pandas as pd
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
import numpy as np
import pandas as pd
dates = pd.date_range("20130101",periods = 6)
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns = list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.593095 -0.861429  0.796412 -1.744072
2013-01-02 -1.406145  1.471192  0.587730  0.703881
2013-01-03 -0.707611 -0.592696  0.505460  1.593782
2013-01-04 -1.039450  2.350577 -0.941984  0.324839
2013-01-05  1.942235 -0.504341  1.293290 -0.210043
2013-01-06  0.339257 -0.088491 -1.270212 -1.102989

In [21]:
print(df.head())
print("\n")
print(df.tail(3))
print("\n")
print(df.index)
print("\n")
print(df.columns)

                   A         B         C         D
2013-01-01 -0.593095 -0.861429  0.796412 -1.744072
2013-01-02 -1.406145  1.471192  0.587730  0.703881
2013-01-03 -0.707611 -0.592696  0.505460  1.593782
2013-01-04 -1.039450  2.350577 -0.941984  0.324839
2013-01-05  1.942235 -0.504341  1.293290 -0.210043


                   A         B         C         D
2013-01-04 -1.039450  2.350577 -0.941984  0.324839
2013-01-05  1.942235 -0.504341  1.293290 -0.210043
2013-01-06  0.339257 -0.088491 -1.270212 -1.102989


DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')


Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
k = df.describe()
print(k)
print(type(k))

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.244135  0.295802  0.161783 -0.072434
std    1.219831  1.305386  1.024843  1.217548
min   -1.406145 -0.861429 -1.270212 -1.744072
25%   -0.956490 -0.570607 -0.580123 -0.879753
50%   -0.650353 -0.296416  0.546595  0.057398
75%    0.106169  1.081271  0.744242  0.609121
max    1.942235  2.350577  1.293290  1.593782
<class 'pandas.core.frame.DataFrame'>

In [29]:
df2 = df.T
df2

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.593095   -1.406145   -0.707611   -1.039450    1.942235    0.339257
B   -0.861429    1.471192   -0.592696    2.350577   -0.504341   -0.088491
C    0.796412    0.587730    0.505460   -0.941984    1.293290   -1.270212
D   -1.744072    0.703881    1.593782    0.324839   -0.210043   -1.102989

In [34]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2013-01-06  0.339257 -0.088491 -1.270212 -1.102989
2013-01-05  1.942235 -0.504341  1.293290 -0.210043
2013-01-04 -1.039450  2.350577 -0.941984  0.324839
2013-01-03 -0.707611 -0.592696  0.505460  1.593782
2013-01-02 -1.406145  1.471192  0.587730  0.703881
2013-01-01 -0.593095 -0.861429  0.796412 -1.744072

In [35]:
df["A"]

2013-01-01   -0.593095
2013-01-02   -1.406145
2013-01-03   -0.707611
2013-01-04   -1.039450
2013-01-05    1.942235
2013-01-06    0.339257
Freq: D, Name: A, dtype: float64

In [39]:
df["A"][0:3]

2013-01-01   -0.593095
2013-01-02   -1.406145
2013-01-03   -0.707611
Freq: D, Name: A, dtype: float64

In [40]:
df.loc[dates[0]]
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.593095 -0.861429
2013-01-02 -1.406145  1.471192
2013-01-03 -0.707611 -0.592696
2013-01-04 -1.039450  2.350577
2013-01-05  1.942235 -0.504341
2013-01-06  0.339257 -0.088491

In [42]:
print(df.iloc[3])
print("\n")
print(df.iloc[3:5,0:2])
print("\n")
print(df.iloc[1:3,:])

A   -1.039450
B    2.350577
C   -0.941984
D    0.324839
Name: 2013-01-04 00:00:00, dtype: float64


                   A         B
2013-01-04 -1.039450  2.350577
2013-01-05  1.942235 -0.504341


                   A         B        C         D
2013-01-02 -1.406145  1.471192  0.58773  0.703881
2013-01-03 -0.707611 -0.592696  0.50546  1.593782

In [44]:
print(df[df>0])
print("\n")
print(df[df["A"]>0])

                   A         B         C         D
2013-01-01       NaN       NaN  0.796412       NaN
2013-01-02       NaN  1.471192  0.587730  0.703881
2013-01-03       NaN       NaN  0.505460  1.593782
2013-01-04       NaN  2.350577       NaN  0.324839
2013-01-05  1.942235       NaN  1.293290       NaN
2013-01-06  0.339257       NaN       NaN       NaN


                   A         B         C         D
2013-01-05  1.942235 -0.504341  1.293290 -0.210043
2013-01-06  0.339257 -0.088491 -1.270212 -1.102989

In [45]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2[df2["E"].isin(["two", "four"])]

                   A         B        C         D     E
2013-01-03 -0.707611 -0.592696  0.50546  1.593782   two
2013-01-05  1.942235 -0.504341  1.29329 -0.210043  four

In [46]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C         D
2013-01-01 -0.593095 -0.861429 -0.796412 -1.744072
2013-01-02 -1.406145 -1.471192 -0.587730 -0.703881
2013-01-03 -0.707611 -0.592696 -0.505460 -1.593782
2013-01-04 -1.039450 -2.350577 -0.941984 -0.324839
2013-01-05 -1.942235 -0.504341 -1.293290 -0.210043
2013-01-06 -0.339257 -0.088491 -1.270212 -1.102989

In [47]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C         D    E
2013-01-01 -0.593095 -0.861429  0.796412 -1.744072  1.0
2013-01-02 -1.406145  1.471192  0.587730  0.703881  1.0
2013-01-03 -0.707611 -0.592696  0.505460  1.593782  NaN
2013-01-04 -1.039450  2.350577 -0.941984  0.324839  NaN

In [49]:
df1.dropna()

                   A         B         C         D    E
2013-01-01 -0.593095 -0.861429  0.796412 -1.744072  1.0
2013-01-02 -1.406145  1.471192  0.587730  0.703881  1.0

In [50]:
df1.interpolate( )

                   A         B         C         D    E
2013-01-01 -0.593095 -0.861429  0.796412 -1.744072  1.0
2013-01-02 -1.406145  1.471192  0.587730  0.703881  1.0
2013-01-03 -0.707611 -0.592696  0.505460  1.593782  1.0
2013-01-04 -1.039450  2.350577 -0.941984  0.324839  1.0